#Создать вектор размер 10, заполненный единицами

import numpy as np
array = np.ones(10, dtype = 'int32')
print(array)