#Создать вектор размера 10, заполненный числом 2.5

import numpy as np
array = np.full(10, 2.5)
print(array)