#Создать вектор (одномерный массив) размера 10, заполненый нулями

import numpy as np

array = np.zeros(10, dtype = 'int32')

print(array)
