#Создать матрицу (двумерный массив) 3x3 со значениями от 0 до 8

import numpy as np
array = np.array([[0,1,2], [3,4,5], [6,7,8]])
print(array)