#Создать массив 3x3x3 со случайными значениями

import numpy as np
array = np.random.randint(1,9,(3,3,3))
print(array)
