#Создать вектор со значениями от 10 до 49

import numpy as np
array = np.arange(10, 50)
print(array)
