#Выведите текущую дату и время
import datetime

dt_now = datetime.datetime.now()
print(dt_now)